app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("firstname", "lastname", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["firstname", "Joshuah"], ["lastname", "Ward"], ["email", "jada@lueilwitz.com"], ["created_at", "2015-09-14 06:39:46.025488"], ["updated_at", "2015-09-14 06:39:46.025488"]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "firstname" = $1, "lastname" = $2, "email" = $3, "updated_at" = $4 WHERE "contacts"."id" = $5  [["firstname", "Elvera"], ["lastname", "Okuneva"], ["email", "savion_satterfield@roberts.com"], ["updated_at", "2015-09-14 06:50:15.883581"], ["id", 184]]